       FD  INTENTORY-TRANSACTION-FILE.
       01  INVENTORY-TRANSACTION-IN.
	       05  TRANSACTION-PART-NUMBER-IN  PIC 9(5).
           05  TRANSACTION-TYPE-IN         PIC 9(1).
           05  TRANSACTION-AMOUNT-IN      PIC 9(3).